# Módulo 07, Tarefa 01

Vamos começar a mexer na nossa base de projeto? Já fizemos um exercício de montar a variável resposta, já pudemos perceber que essa atividade pode não ser trivial. Vamos agora trabalhar a base para que fique propícia ao *scikitlearn* para trabalharmos.

Lembrando, a base se chama demo01.csv, e originalmente está publicada [aqui](https://www.kaggle.com/rikdifos/credit-card-approval-prediction).

#### 1) Carregue a base e avalie:

- As variáveis
- Tipos de dados de cada variável
- Quantidade de missings
- Distribuição da variável resposta (mau)

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
df = pd.read_csv('demo01.csv')
df.head()

,sexo,posse_de_veiculo,posse_de_imovel,qtd_filhos,tipo_renda,educacao,estado_civil,tipo_residencia,idade,tempo_emprego,possui_celular,possui_fone_comercial,possui_fone,possui_email,qt_pessoas_residencia,mau
0,M,Y,Y,0,Working,Secondary / secondary special,Married,House / apartment,58.832877,3.106849,1,0,0,0,2.0,False
1,F,N,Y,0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,52.356164,8.358904,1,0,1,1,1.0,False
2,F,N,Y,0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,52.356164,8.358904,1,0,1,1,1.0,False
3,M,Y,Y,0,Working,Higher education,Married,House / apartment,46.224658,2.106849,1,1,1,1,2.0,False
4,F,Y,N,0,Working,Incomplete higher,Married,House / apartment,29.230137,3.021918,1,0,0,0,2.0,False

#### 2) Vamos montar um metadados

1. Crie um dataframe com os nomes de cada variável e o tipo de dados de cada variável.
2. Adicione uma coluna nesse *dataframe* chamada "qtd_categorias" e coloque nela o número de categorias correspondente de cada variável. 
    Dica: 
        1. inicie uma lista vazia
        2. faça um for ao longo dos nomes das variáveis, 
        3. conte o número de categorias dessa variável 
        4. acumule essa informação de 3. na lista que você criou em 1. 
        5. No final, essa lista pode ser atribuída à nossa variável.
3. Crie variáveis dummy para as variáveis necessárias (i.e. aquelas que são qualitativas e não estão armazenadas como {0, 1} ou {True, False}.

In [2]:
metadados = pd.DataFrame(df.nunique()).reset_index()
metadados.columns=['variaveis','qtd_categorias']
tp = []
tp = list(df.dtypes)
metadados['tipo_dados'] = tp
metadados

                variaveis  qtd_categorias tipo_dados
0                    sexo               2     object
1        posse_de_veiculo               2     object
2         posse_de_imovel               2     object
3              qtd_filhos               8      int64
4              tipo_renda               5     object
5                educacao               5     object
6            estado_civil               5     object
7         tipo_residencia               6     object
8                   idade            5298    float64
9           tempo_emprego            3005    float64
10         possui_celular               1      int64
11  possui_fone_comercial               2      int64
12            possui_fone               2      int64
13           possui_email               2      int64
14  qt_pessoas_residencia               9    float64
15                    mau               2       bool

#### 3) Crie variáveis dummy para as variáveis necessárias (i.e. aquelas que são qualitativas e não estão armazenadas como {0, 1} ou {True, False}. Crie um *dataframe* apenas com as variáveis apropriadas para entrada no scikitlearn - elimine as variáveis tipo *str*, mantendo apenas suas versões *dummy*.

In [3]:
df.select_dtypes(include='object').head()

,sexo,posse_de_veiculo,posse_de_imovel,tipo_renda,educacao,estado_civil,tipo_residencia
0,M,Y,Y,Working,Secondary / secondary special,Married,House / apartment
1,F,N,Y,Commercial associate,Secondary / secondary special,Single / not married,House / apartment
2,F,N,Y,Commercial associate,Secondary / secondary special,Single / not married,House / apartment
3,M,Y,Y,Working,Higher education,Married,House / apartment
4,F,Y,N,Working,Incomplete higher,Married,House / apartment

In [4]:
metadados
metadados[metadados['tipo_dados'] != ('object')].T

,3,8,9,10,11,12,13,14,15
variaveis,qtd_filhos,idade,tempo_emprego,possui_celular,possui_fone_comercial,possui_fone,possui_email,qt_pessoas_residencia,mau
qtd_categorias,8,5298,3005,1,2,2,2,9,2
tipo_dados,int64,float64,float64,int64,int64,int64,int64,float64,bool

### Alterando Variáveis

In [5]:
df.sexo.unique()

array(['M', 'F'], dtype=object)

In [6]:
df.sexo = df.sexo.map({'F': 1, 'M':0})
df.sexo.unique()

array([0, 1], dtype=int64)

In [7]:
df.posse_de_veiculo.unique()

array(['Y', 'N'], dtype=object)

In [8]:
df.posse_de_veiculo = df.posse_de_veiculo.map({'Y': 1, 'N':0})
df.posse_de_veiculo.unique()

array([1, 0], dtype=int64)

In [9]:
df.posse_de_imovel.unique()

array(['Y', 'N'], dtype=object)

In [10]:
df.posse_de_imovel = df.posse_de_imovel.map({'Y': 1, 'N':0})
df.posse_de_imovel.unique()

array([1, 0], dtype=int64)

In [11]:
df.mau= df.mau.astype(int)

### Variáveis Dumming
tipo_renda            
educacao          
estado_civil          
tipo_residencia

In [12]:
df.tipo_renda.unique()

array(['Working', 'Commercial associate', 'State servant', 'Pensioner',
       'Student'], dtype=object)

In [13]:
df.educacao.unique()

array(['Secondary / secondary special', 'Higher education',
       'Incomplete higher', 'Lower secondary', 'Academic degree'],
      dtype=object)

In [14]:
df.estado_civil.unique()

array(['Married', 'Single / not married', 'Civil marriage', 'Widow',
       'Separated'], dtype=object)

In [15]:
df.tipo_residencia.unique()

array(['House / apartment', 'Rented apartment', 'Municipal apartment',
       'With parents', 'Co-op apartment', 'Office apartment'],
      dtype=object)

In [23]:
dados_encoded = pd.get_dummies(df, columns=['tipo_renda','educacao','estado_civil' ,'tipo_residencia'], drop_first=True)
dados_encoded.sample(5)

,sexo,posse_de_veiculo,posse_de_imovel,qtd_filhos,idade,tempo_emprego,possui_celular,possui_fone_comercial,possui_fone,possui_email,...,educacao_Secondary / secondary special,estado_civil_Married,estado_civil_Separated,estado_civil_Single / not married,estado_civil_Widow,tipo_residencia_House / apartment,tipo_residencia_Municipal apartment,tipo_residencia_Office apartment,tipo_residencia_Rented apartment,tipo_residencia_With parents
11730,1,0,1,0,50.545205,26.528767,1,0,0,0,...,1,0,0,1,0,1,0,0,0,0
14316,1,0,1,0,56.904110,-1000.665753,1,0,0,0,...,1,1,0,0,0,1,0,0,0,0
2405,1,0,0,0,65.024658,16.621918,1,0,0,0,...,1,1,0,0,0,1,0,0,0,0
3679,0,0,0,1,41.093151,0.879452,1,1,1,0,...,1,1,0,0,0,1,0,0,0,0
6541,0,1,1,2,32.553425,0.495890,1,0,0,0,...,0,0,0,1,0,1,0,0,0,0

#### 4) Qual variável é mais poderosa?

Considere as variáveis ```possui_email``` e ```posse_de_veiculo```. Faça uma tabela cruzada entre elas e responda qual delas te parece mais poderosa para prever a probabilidade de ```mau = 1```?

In [17]:
dados_encoded.mau.unique()

array([0, 1])

In [18]:
freq = pd.crosstab(dados_encoded['possui_email'],dados_encoded['mau'])
freq
# freq.sum(axis = 1)

mau               0    1
possui_email
0             14810  360
1              1450   30

In [19]:
freq = pd.crosstab(dados_encoded['posse_de_veiculo'],dados_encoded['mau'])
freq

mau                  0    1
posse_de_veiculo
0                 9931  247
1                 6329  143

### Conclusão
A variável ```possui_email``` apresenta-se como o caminho mais viável para prever se o cliente será um bom ou mau pagador, pois mais de 90% dos maus pagadores não possuiam email.

#### 5) Salve a base, pois ela será utilizada no final deste módulo.

In [20]:
dados_encoded.to_csv('dados_encoded.csv')